# ColumnTopAttachJustificationParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnTopAttachJustificationParam Property
ParameterTypeId Class See Also
---
"Attachment Justification At Top"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnTopAttachJustificationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnTopAttachJustificationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnTopAttachJustificationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace